Repository: sebedard13/ImageGenerator
Catalog: data/localization/*.po
Languages: fr

# mainWindowName
source: World generation app
fr: Application Génération de Monde

# btnSave
source: Save
fr: Sauvegarder

# saveRtnEmpty
source: Can not save image, it is empty
fr: Impossible de sauvegarder l'image, l'image est vide

# saveRtnGood
source: Image saved with success
fr: Image sauvegardée avec succès

# saveRtnBad
source: Can not save image
fr: Impossible de sauvegarder l'image

# saveRtnCompression
source: Image compression
fr: Compression de l'image

# btnLoad
source: Load
fr: Charger

# btnQuit
source: Quit
fr: Quitter

# btnSeeAbout
source: See
fr: Voir

# btnGenerateMap
source: Generate
fr: Générer

# btnFile
source: File
fr: Fichier

# btnAbout
source: About
fr: À propos

# btnThreadNumberTitle
source: Number of thread
fr: Nombre de thread

# tipNothing
source: Waiting for user
fr: En attente de l'utilisateur

# tipLoadingPerlinNoise
source: Generate Perlin Noise
fr: Génération bruit Perlin

# tipLoadingRandomVoronoi
source: Generate Voronoi diagram
fr: Génération diagramme de Voronoi

# tipLoadView
source: Generate image
fr: Génération de l'image

# tipAlgoDistanceFromCenter
source: Calculate distances
fr: Calcul des distances

# algoPerlinNoiseName
source: Noise Perlin
fr: Bruit de Perlin

# algoRandomVoronoiName
source: Random Voronoi
fr: Voronoi Aléatoire

# labelSize
source: Size of image
fr: Taille de l'image

# labelSeed
source: Seed
fr: Germe aléatoire

# labelCellSize
source: Size of bigger cell
fr: Taille du plus grande cellule

# labelOctaves
source: Octaves to add details
fr: Octaves pour augmenter les détails

# labelPersistence
source: Persistence in octaves
fr: Persistance dans les octaves

# labelNbPoints
source: Number of points
fr: Nombre de points

# btnLanguages
source: Languages
fr: Langues

# labelRoughness
source: Image roughness
fr: Rugosité de l'image

# tipAlgoDiamondSquare
source: Generate diamond Square
fr: Génération du diamond Square

# labelNbPlates
source: Number of tectonic plates
fr: Nombre de plaques tectoniques

# labelMaxIteration
source: Max number of iteration
fr: Nombre max d'itération

# labelMaxCycle
source: Max number of Cycle
fr: Nombre max de cycle

# labelMapRoughness
source: Start map roughness
fr: Rugosité de la map initial

# labelSeaLevel
source: Percent of sea at the start
fr: Pourcentage d'océan dans la map initial

# labelErosionPeriod
source: Period to erode the plates
fr: Période pour l'érosion des plaques

# labelFoldingRatio
source: Folding of continental collision
fr: Ratio de pli des collisions continentales

# labelAggrRatioAbs
source: Value of plate superposition to merge
fr: Valeur de superposition pour combiner les plaques

# labelAggrRatioRel
source: Percent of plate superposition to merge
fr: Pourcent de superposition pour combiner les plaques
